//
//  Facts.swift
//  Recycle.it
//
//  Created by Nouf aldghaim on 4/7/20.
//  Copyright © 2020 Nouf. All rights reserved.
//

import Foundation
import GameKit

struct FactSource {

    let goodfacts = [
       "لتّقليل من تلوّث مياه البحار والمُحيطات والأنهار من رمي النّفايات الصّلبة فيه، وتهديد الأحياء البحريّة، كما تُقلّل من تلوّث المياه الجوفيّة من عصارة النّفايات النّاتجة عن طمر النّفايات",
 "حقيق مبدأ التّنمية المُستدامة من أجل المُحافظة على البيئة، وتقليل استهلاك الموادّ الخام من أجل الأجيال القادمة.",
 "توفير المبالغ المالية التي كان يتمّ صرفها على مَكبّات النّفايات وعمليّات الطّمر.",
       "تقليل عمليّات قطع الأشجار واستنزاف الغابات عن طريق إعادة تصنيع الأخشاب واستخدامها مرّة أخرى",
       "وفير الطّاقة التي تُستهلَك في استخراج الموادّ الخام ثمّ تصنيعها، إذ إنّ عمليّة التّدوير هي نصف عمليّة تصنيعيّة"
      ]
    
    
    func randomFacts () -> String {
     
         let factsIndex = GKRandomSource.sharedRandom().nextInt(upperBound: goodfacts.count)
        
        return goodfacts[factsIndex]
        
}

}

struct Facts {
    
        let facts = ["95% من معلومات العالم لاتزال مخزنه على الورق واغلبها لاتتم مشاهدته مرة اخرى",
        "اعادة تدوير قاروة بلاستيك يوفر طاقة كافية لاضاءة مصباح بقدرة 60 واط لمدة 6 ساعات",
        "الاف المخلوقات البحرية تموت بسبب ابتلاعها اكياس البلاستيك التي تشبه قنديل البحر",
        "في كل عام يرمي الامريكان قوارير وزجاجات كافية لوصول القمر والعودة اليه 20 مره",
        "اعادة تدوير طن من البلاستيك يمكن ان يوفر حوالي 2000 غالون من البنزين",
        "بداية من عام 2015 جميع سكان نيويورك عليهم اعادة تدوير الاجهزة الالكترونية والا سيواجهون غرامه مقدارها 100 دولا",
        "اعادة تدوير علبة المنيوم يمكن ان يوفر طاقة تكفي لتشغيل تلفاز لساعتين",
        "اعادة تدوير طن من الورق يحافظ على 17 شجره",
        "اعادة تدوير علبة المنيوم يمكن ان يعيدها الى رف متجر خلال 60 يوم",
        "إبدأ إعادة التدوير بتقليل استخدامك للبلاستك"]
        
    func randomFact() -> String {
        let factIndex = GKRandomSource.sharedRandom().nextInt(upperBound: facts.count)
        return facts[factIndex]
    }
   
}
struct BadFacts {
let badFacts = [
    "زيادة أعداد الحيوانات القارضة كالفئران والحشرات، ممّا يُسبّب اختلالاً بيئيّاً.",
    "تلوّث التّربة والتسبُّب بموت النّباتات والحيوانات في مناطق الطّمر.",
"انتشار الأمراض السرطانيّة والميكروبيّة بسبب وضع مكبّات النّفايات بالقرب من المناطق السكنيّة، كما وتتسبّب عمليّات حرق النّفايات بالكثير من الأمراض التنفسيّة",
"تلّوث المياه الجوفيّة نتيجة تسلّل عصارة النّفايات المطمورة إلى باطن الأرض.",
"زيادة نسبة ثاني أُكسيد الكربون، الأمر الذي يُشكّل السّبب الرّئيس لارتفاع درجة حرارة الأرض، وذوبان الثّلوج، وتعرّض الأرض للفيضانات",
"انتشار الأمراض السرطانيّة والميكروبيّة بسبب وضع مكبّات النّفايات بالقرب من المناطق السكنيّة، كما وتتسبّب عمليّات حرق النّفايات بالكثير من الأمراض التنفسيّة."
    
    ]
    func randomBad() -> String {
       let badfactIndex = GKRandomSource.sharedRandom().nextInt(upperBound: badFacts.count)
        return badFacts[badfactIndex]
    }
    
    
    
    
}




